In [5]:
import pandas as pd

In [6]:

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [19]:
#1. Display Top 3 Rows

df1.head(3)

Top 3 rows

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [20]:
#3. Check Last three rows

print("Bottom 3 rows")
df1.tail(3)

Bottom 3 rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [24]:
# 4.shape of our dataset(number of columns and rows)

df1.shape
print("Number of Rows = ", df1.shape[0])
print("Number of Columns = ", df1.shape[1])

Number of Rows =  7
Number of Columns =  3

In [26]:
# Information of dataframe like number of rows,columns,
# datatype of each memory and columns

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [30]:
# Check null values in the datashet

df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [32]:
# Get overall statistics anout dataframe

df1.describe(include = "all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Archana        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [34]:
# find the unique values from the gender column
df1
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [35]:
# find the number unique values from the gender column
df1["Gender"].nunique()

2

In [37]:
# find the count of unique values from the gender column
df1["Gender"].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [41]:
# Find total number of students having marks between
# 90 to 100 inclusive 
df1[(df1["Marks"]>=90) & (df1["Marks"]<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [47]:
len(df1[(df1["Marks"]>=90) & (df1["Marks"]<=100)])

4

In [8]:
# Find total number of students having marks between
# 90 to 100 inclusive using Between method
df1[df1["Marks"].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [51]:
len(df1[df1["Marks"].between(90,100)])

4

In [52]:
sum(df1["Marks"].between(90,100))

4

In [9]:
# Apply Function to a column
def divison(x):
    return x/2

In [54]:
df1["Marks"].apply(divison)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [27]:
# Add column 
df1["Half Marks"] = df1["Marks"].apply(divison)

In [28]:
df1

      Name  Marks  Gender  Male_Female  Half Marks
0  Priyang     98    Male            1        49.0
1   Aadhya     89  Female            0        44.5
2   Krisha     99  Female            0        49.5
3   Vedant     87    Male            1        43.5
4   Parshv     90    Male            1        45.0
5   Mittal     83  Female            0        41.5
6  Archana     99  Female            0        49.5

In [16]:
# Change Male to 1 and Female to 0

df1["Gender"].map({"Male":1,"Female":0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [29]:
df1["Male_Female"] = df1["Gender"].map({"Male":1,"Female":0})
df1

      Name  Marks  Gender  Male_Female  Half Marks
0  Priyang     98    Male            1        49.0
1   Aadhya     89  Female            0        44.5
2   Krisha     99  Female            0        49.5
3   Vedant     87    Male            1        43.5
4   Parshv     90    Male            1        45.0
5   Mittal     83  Female            0        41.5
6  Archana     99  Female            0        49.5

In [31]:
# Drop columns
df1.drop(["Half Marks","Male_Female"], axis =1, inplace = True)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [32]:
#Name od the columns
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [33]:
#Row Index
df1.index

RangeIndex(start=0, stop=7, step=1)

In [35]:
#Short dataframe as per marks column (doc string = shift+tab)
df1.sort_values(by ="Marks")

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [36]:
df1.sort_values(by ="Marks", ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [43]:
# Name and marks of only female students
df1[df1["Gender"] == "Female"]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [46]:
df1[df1["Gender"] == "Female"][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [48]:
df1[df1["Gender"].isin(["Female"])][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99